In [50]:
import xlrd
import pandas as pd
import numpy as pd

In [3]:
import os
files_05 = os.listdir('./데이터/202205_시내')
files_06 = os.listdir('./데이터/202206_시내')

In [5]:
df_05 = pd.DataFrame()

for i in files_05 :
    data = pd.read_excel('./데이터/202205_시내/' + i, header = 1)
    data['날짜'] = i.split('_')[1]
    df_05 = pd.concat([df_05, data])

In [15]:
df_06 = pd.DataFrame()

for i in files_06 :
    data = pd.read_excel('./데이터/202206_시내/' + i, header = 1)
    data['날짜'] = i.split('_')[1]
    df_06 = pd.concat([df_06, data])

In [16]:
df = pd.concat([df_05, df_06])

In [30]:
df_use = df[['정류장코드', '정류장명', '승차합계', '하차합계', '날짜']]
df_use.head(3)

     정류장코드       정류장명       승차합계     하차합계        날짜
0       합계         합계  1,174,516  470,049  20220517
1  2620843  연제공용버스차고지         48        0  20220517
2  2609878     개인택시조합          0        0  20220517

In [36]:
index = df_use[df_use['정류장코드'] == '합계'].index
df_use = df_use.drop(index)

In [54]:
df_use['날짜'] = pd.to_datetime(df_use['날짜'], format = '%Y-%m-%d')
df_use

         정류장코드       정류장명 승차합계 하차합계         날짜
1      2620843  연제공용버스차고지   48    0 2022-05-17
2      2609878     개인택시조합    0    0 2022-05-17
3      2609879      부산의료원   42    0 2022-05-17
4      2609880    삼정그린아파트   18    0 2022-05-17
5      2601702    사직실내수영장   47    1 2022-05-17
...        ...        ...  ...  ...        ...
16538  2602920     동일고무벨트    2   20 2022-06-15
16539  2620137   부산예원고등학교    3   27 2022-06-15
16540  2612254       욱성화학    4   44 2022-06-15
16541  2604744       회동본동    0   10 2022-06-15
16542  2604745    회동동(기점)    9   41 2022-06-15

[1009038 rows x 5 columns]